Documents/МГС_ВозвратБаллоновОтКонтрагентов_.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>МГС_ВозвратБаллоновОтКонтрагентов_</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.МГС_ВыпускБаллонов_</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБаллоновВозвращено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКонтейнера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемосдатчик1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Баллоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Баллон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_Баллоны_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипБаллона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МГС_ТипыБаллонов_</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧислятсяПоОтправочнымДокументам</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/МГС_ВозвратБаллоновОтКонтрагентов_/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораПоБаллонам(Текст, Период) Экспорт
    
	спВыбора    =    Новый СписокЗначений;
	
	Текст = СтрЗаменить(Текст," ","");
	
	Запрос    =    Новый Запрос;
	Запрос.Текст    =    "ВЫБРАТЬ
	                     |	МГС_Баллоны.Ссылка КАК Ссылка,
	                     |	МГС_Баллоны.ВесТары КАК ВесТары
	                     |ПОМЕСТИТЬ Вт_Баллоны
	                     |ИЗ
	                     |	Справочник.МГС_Баллоны КАК МГС_Баллоны
	                     |ГДЕ
	                     |	МГС_Баллоны.Наименование ПОДОБНО &Наименование
	    //                 |	И МГС_Баллоны.ТипБаллона = &ТипБаллона
	                     |;
	                     |
	                     |////////////////////////////////////////////////////////////////////////////////
	                     |ВЫБРАТЬ
	                     |	МГС_АттестацияБаллоновСрезПоследних.ДатаСледующейАттестации КАК ДатаСледующейАттестации,
	                     |	Вт_Баллоны.Ссылка КАК Ссылка,
	                     |	Вт_Баллоны.Ссылка.Наименование КАК Наименование,
	                     |	Вт_Баллоны.ВесТары КАК ВесТары
	                     |ИЗ
	                     |	Вт_Баллоны КАК Вт_Баллоны
	                     |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МГС_АттестацияБаллонов.СрезПоследних(
	                     |				&Период,
	                     |				Баллон В
	                     |					(ВЫБРАТЬ
	                     |						Вт_Баллоны.Ссылка
	                     |					ИЗ
	                     |						Вт_Баллоны КАК Вт_Баллоны)) КАК МГС_АттестацияБаллоновСрезПоследних
	                     |		ПО Вт_Баллоны.Ссылка = МГС_АттестацияБаллоновСрезПоследних.Баллон";
	                    
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Наименование", Текст);    
	//Запрос.УстановитьПараметр("ТипБаллона", ТипБаллона);   
	Выборка    =    Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл      
	    ПредставлениеБаллона    =    Выборка.Наименование+ " " +Выборка.ВесТары + " (" + Формат(Выборка.ДатаСледующейАттестации,"ДФ='MMMM yyyy'")  +")";	    
	    спВыбора.Добавить(Выборка.Ссылка, 
	                            ПредставлениеБаллона);    	
	КонецЦикла; 
	//спВыбора.Добавить(Текст,  "...ввести новый баллон...");    						
	Если спВыбора.Количество() = 0 Тогда
		спВыбора= Неопределено
	КонецЕсли;
    Возврат спВыбора;

КонецФункции // ПолучитьДанныеВыбораФИО()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если ЗначениеЗаполнено(параметры.ЗначениеКопирования) Тогда
		Отказ = истина;
		Возврат;		
	КонецЕсли; 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	//ОбновитьВидимостьЗакрытияОткрытияАнализа();
	//Вставить содержимое обработчика
КонецПроцедуры


//&НаСервере
//Процедура ОбновитьВидимостьЗакрытияОткрытияАнализа()
//	
//	// Вставить содержимое обработчика.
//	Если Объект.Проведен Тогда	
//		
//		Элементы.АнализОдобрен.Видимость = Ложь;
//		//ЭтаФорма.ТолькоПросмотр = Истина;
//		
//		Для каждого Элемент из ЭтаФорма.Элементы Цикл
//			Если Элемент. имя ="ГруппаСтандартныхКоманд"
//			Или Элемент. имя ="ОткрытьАнализ"
//			Или Элемент. имя ="КоманднаяПанельФормы"
//			Или Элемент. имя ="ФормаКоманднаяПанель"
//			Или СтрНайти(Элемент. имя,"Печат")>0
//			Или СтрНайти(Элемент. имя,"СоздатьНаОсновании")>0
//			или  ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
//				Продолжить;
//			КонецЕсли;
//			Элемент.Доступность=Ложь
//		КонецЦикла;
//		Элементы.ОткрытьАнализ.Видимость = Истина;
//		Элементы.ОткрытьАнализ.Доступность = Истина;
//	Иначе
//		Элементы.АнализОдобрен.Видимость = Истина;
//		Для каждого Элемент из ЭтаФорма.Элементы Цикл
//			Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
//				Продолжить;
//			КонецЕсли;
//			Элемент.Доступность=Истина
//		КонецЦикла;
//		Элементы.ОткрытьАнализ.Видимость = Ложь;
//		Элементы.ОткрытьАнализ.Доступность = Ложь;
//	КонецЕсли;
//КонецПроцедуры


&НаКлиенте
Процедура БаллоныБаллонОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ДанныеВыбора = ПолучитьДанныеВыбораПоБаллонам(Текст, Объект.Дата); 
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура БаллоныБаллонИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	//НачалоПериода  =  НачалоДня(Объект.ДатаНачала-24*60*60);
	//ОкончаниеПериода =   КонецДня(Объект.ДатаОкончания);
	
	// Вставить содержимое обработчика.
	Объект.ДокументыОтгрузки.Очистить();
	
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МГС_БаллоныУКонтрагентовОстатки.ТипБаллона КАК ТипБаллона,
//	|	МГС_БаллоныУКонтрагентовОстатки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	МГС_БаллоныУКонтрагентовОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.МГС_БаллоныУКонтрагентов.Остатки(
	|			&Граница,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент) КАК МГС_БаллоныУКонтрагентовОстатки";
	
		
	//Запрос.УстановитьПараметр("Граница", Новый Граница(Новый МоментВремени(объект.дата,объект.ссылка), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Граница", объект.дата);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);

	РезультатЗапроса =  Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаДокументыОтгрузки= Объект.ДокументыОтгрузки.Добавить();
		//СтрокаДокументыОтгрузки.ДокументОтгрузки = ВыборкаДетальныеЗаписи.ДокументОтгрузки;
		СтрокаДокументыОтгрузки.ТипБаллона =  ВыборкаДетальныеЗаписи.ТипБаллона;
		СтрокаДокументыОтгрузки.Количество =  ВыборкаДетальныеЗаписи.КоличествоОстаток;
		
	КонецЦикла;
	

 КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Вставить содержимое обработчика.
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПолучитьТипБаллонаПоНоменклатуре(ДокументОтгрузки)
//	// Вставить содержимое обработчика.
//	возврат документы.МГС_ОтгрузкаБаллонов.ПолучитьТипБаллонаПоНоменклатуре(ДокументОтгрузки.Номенклатура)
//КонецФункции


//&НаКлиенте
//Процедура ДокументыОтгрузкиДокументОтгрузкиПриИзменении(Элемент)
//	// Вставить содержимое обработчика.
//	ТекущиеДанные = Элементы.ДокументыОтгрузки.ТекущиеДанные;
//	ТекущиеДанные.ТипБаллона =ПолучитьТипБаллонаПоНоменклатуре(ТекущиеДанные.ДокументОтгрузки) 
//КонецПроцедуры
